app/views/patients/index.html.erb

SELECT COUNT(*) FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 1]]
---
      Name: <%= link_to patient.name, patient_path(patient) %>
      Number of Appointments: <%= patient.appointments.size %>