app/views/patients/show.html.erb

<ul>
  <% @patient.appointments.each do |app| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 2]]