app/views/doctors/index.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."doctor_id" = ?  [[nil, 11]]
SELECT COUNT(*) FROM "patients" INNER JOIN "appointments" ON "patients"."id" = "appointments"."patient_id" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 11]]
---
    <%= link_to doctor.name, doctor_show(doctor) %>
    <p><%= doctor.patients.count %></p>