app/views/doctors/show.html.erb

<ul>
  <% @doctor.appointments.each do |appoint| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 1]]