app/controllers/appointments_controller.rb

  def show
    @appointment = Appointment.find(params[:id])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", 1]]